# -*- coding: utf-8 -*-
PAUSE_MESSAGES = [u'Я на паузе.',
                  u'Серьёзно, я пока не буду коды вбивать.',
                  u'Ты слышишь? Коды не вбиваю, задания не присылаю',
                  u'Алё, гараж? Ты или запусти меня или хватит слать тут.',
                  u'Я ща реально обижусь',
                  u'Ох ну ты и тугой.',
                  u'Всё. Ничего не делаю']
RESUME_MESSAGES = [u'Я тебя сейчас наверное удивлю, но я и так работаю.',
                   u'Прикинь, да, вот просто так можешь отсылать коды и всё будет ок.',
                   u'Ну хватит уже, нечем другим заняться больше? Давай, работай',
                   u'Ох ну ты и тугой.',
                   u'Я и так работаю']
GREETINGS_MESSAGES = [u"Привет! Я твой дружочек. Соскучился? А я да. Давай мне свой логин для игры.",
                      u"Здравствуй, дорогой! Как дела?",
                      u"Приветули",
                      u"Оп-па, какие люди!",
                      ]
BYE_MESSAGES = [u"Всё, давай, пока!",
                u"Давай, до свидания!",
                u"До скорых встреч, уважаемый.",
                u"Спасибо, пойду спать."]
AFFIRMATIVE_MESSAGES = [u"Я понял тебя, братан",
                        u"Замётано",
                        u"Так точно"]
NOT_IN_CHAT_MESSAGES = [u"Напиши мне в чате, а не в личку."]
START_PAUSE_MESSAGES = [u"Отдохну немного.",
                        u"Ну пауза так пауза",
                        u"Так. Не трогаю пока ничего тут",
                        ]
END_PAUSE_MESSAGES = [u"Так, продолжаем.",
                      u"И снова здравствуйте!",
                      u"Бот возобновил работу.",
                      ]
LETS_GO_MESSAGES = [u"Ну всё, погнали!",
                    u"Поехали!",
                    u"Воо-оо-оойтии-ии-и в игруу-уу-уу"]
NO_CODE_FOUND_MESSAGES = [u'_Нет кодов для вбития. Попробуй ещё раз. Формат: /c code1 code2_']
GIVE_ME_LOGIN = [u"Давай мне свой *логин* для игры."]
GIVE_ME_PASSWORD = [u"Ага, ага. А *пароль*?"]
GIVE_ME_HOST = [u"А на каком *домене* игра?"]
GIVE_ME_GAME = [u"Ок, какой *номер игры*?"]
CONNECTION_PROBLEM_MESSAGES = [u"---*Проблемы с авторизацией на сайте!*---"]
CONNECTION_OK_MESSAGES = [u"---*Авторизация на сайте успешна!*---"]
PLEASE_APPROVE_MESSAGES = [
    u"---*Для дальнейшей работы выполни команду* /approve *в игровом чате*---"]
TOO_MUCH_ATTEMPTS_MESSAGES = [
    u"---*Слишком много неуспешных попыток авторизоваться. *---"]
ACCESS_VIOLATION_MESSAGES = [
    u"*Я дико извиняюсь, но я не буду это делать*",
    u"*Не, ну это несерьёзно. Мне что, старшего позвать?*",
    u"*Хватит. Я всё равно тебя не слушаюсь*",
]
